<?php // -*- mode: php; coding: euc-japan -*-

// To be used by ps-anew and pre-conference.
$_lib_u_everybody_ps_prep_cols = array
(

'医師' => array(

"診断名", "発症日", "並存疾患・合併症",
"コントロール状態", "リハビリテーション歴",

'//全般',

"運動障害", "運動障害コメント",
"関節可動域制限", "関節可動域制限コメント",
"構成障害", "構成障害コメント",
"心身機能・その他",

"活動度", "活動度・短期目標",
"活動度・アプローチ",

'//心身機能・活動',

"参加・短期目標", "参加・アプローチ",
"抑鬱", "障害の否認", "その他心理",
"心理・短期目標", "心理・アプローチ",

'//参加・心理',

"自宅改造", "自宅改造内容",
"福祉機器", "福祉機器内容", "社会保障サービス", "社会保障サービス内容",
"介護保険サービス", "介護保険サービス内容", "環境・短期目標",
"環境・アプローチ",

'//環境',

"発病による家族の変化", "社会生活",
"健康上の問題の発生", "心理的問題の発生",
"第三者の不利・評価・備考",
"退院後の主介護者",
"退院後の主介護者内容", "家族構成の変化", "家族構成の変化内容",
"家族内役割の変化", "家族内役割の変化内容", "家族の社会活動変化",
"家族の社会活動変化内容",
"第三者の不利・短期目標",
"第三者の不利・アプローチ",

'//家族・第三者',

"1ヶ月後の目標", "本人の希望",
"家族の希望", "リハビリテーションの治療方針", "外泊計画",
"退院時目標・見込時期", "将来計画",
"将来または退院後の社会参加の見込み",

'//計画',
),

'看護師' => array(),

'PT' => array(
"寝返り", "起き上がり", "座位", "立ち上がり", "立位",
"基本動作・短期目標", "基本動作・アプローチ",
"車椅子移乗・短期目標", "車椅子移乗・アプローチ",
"移動・短期目標", "移動・アプローチ",
),

'OT' => array(
"セルフケア・短期目標", "セルフケア・アプローチ",
"移乗・短期目標", "移乗・アプローチ", 
"車椅子・短期目標", "車椅子・アプローチ",
),

'ST' => array(
"コミュニケーション・短期目標", "コミュニケーション・アプローチ",
"社会的認知・短期目標", "社会的認知・アプローチ",
),

'MSW' => array(
"職業", "職種・業種・仕事内容", "経済状況", "社会参加（内容、頻度等）",
"余暇活動（内容、頻度等）", "退院先", "復職", "復職時期", "仕事内容",
"通勤方法", "家庭内役割", "社会活動", "趣味",
"同居家族", "親族関係",
"住居形態", "階数", "居室の種類", "トイレ様式", "住宅改修の可否",
"家周囲", "交通",
),

);

function _lib_u_everybody_ps_prep_validate(&$it) {
	$nullify_cols = array(
		"発症日","年齢",
		"主治医","リハ担当医","PT","OT","ST","看護師","SW",
		"診断名","並存疾患・合併症",

		"トイレ_P",
		"トイレ_TP",
		"トイレ動作_P",
		"トイレ動作_TP",
		"ベッド・椅子・車椅子_P",
		"ベッド・椅子・車椅子_TP",
		"階段_P",
		"階段_TP",
		"記憶_P",
		"記憶_TP",
		"更衣・下半身_P",
		"更衣・下半身_TP",
		"更衣・上半身_P",
		"更衣・上半身_TP",
		"社会的交流_P",
		"社会的交流_TP",
		"車椅子_P",
		"車椅子_TP",
		"食事_P",
		"食事_TP",
		"整容_P",
		"整容_TP",
		"清拭_P",
		"清拭_TP",
		"排尿管理_P",
		"排尿管理_TP",
		"排泄管理_P",
		"排泄管理_TP",
		"表出_P",
		"表出_TP",
		"歩行_P",
		"歩行_TP",
		"問題解決_P",
		"問題解決_TP",
		"浴槽シャワー_P",
		"浴槽シャワー_TP",
		"理解_P",
		"理解_TP",

		);
	

	foreach ($nullify_cols as $c) {
		if ($it->data[$c] == "")
			$it->data[$c] = NULL;
	}
	$bad = 0;
	if ($st = mx_db_validate_date($it->data['日付'])) {
		$it->err("(日付): $st\n");
		$bad++;
	}
	foreach (array("発症日") as $c) {
		if (!is_null($it->data[$c])) {
			if ($st = mx_db_validate_date($it->data[$c])) {
				$it->err("($c): $st\n");
				$bad++;
			}
		}
	}
	if ($bad == 0)
		return 'ok';
}

?>
